Tekla Open API Reference for Tekla Structures 2025
RebarItemEnumerator.SelectRebarItem Method (String, String, Double)
 Selects a rebar item in the rebar database with the given grade, size and bending radius.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static RebarItem SelectRebarItem(
	string Grade,
	string Size,
	double BendRadius
)
Public Shared Function SelectRebarItem (
	Grade As String,
	Size As String,
	BendRadius As Double
) As RebarItem
Parameters
Grade
Type: System.String
The grade of the rebar item to select.
Size
Type: System.String
The size of the rebar item to select.
BendRadius
Type: System.Double
The bending radius of the rebar item to select.
Return Value
Type: RebarItem
The first RebarItem that matches the conditions.
See Also
Reference
RebarItemEnumerator Class
SelectRebarItem Overload
Tekla.Structures.Catalogs Namespace